Revit 2027 API
ViewActivatingEventArgs.CurrentActiveView Property
 The view that is currently active.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public View CurrentActiveView { get; }
Public ReadOnly Property CurrentActiveView As View
	Get
public:
property View^ CurrentActiveView {
	View^ get ();
}
member CurrentActiveView : View with get
Property Value
View
Remarks
 May be null if there is no currently active view.
See Also
Reference
ViewActivatingEventArgs Class
Autodesk.Revit.UI.Events Namespace